Documents/ПеремещениеТовараПоЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПеремещениеТовараПоЯчейкам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоРодителю</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоЯчейке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клеверенс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаИнвентаризацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаКуда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПереместить</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеРазмещены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВведеноВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПеремещениеТовараПоЯчейкам/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Необходимые проверки...
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Если ТекСтрокаТовары.Ячейка = ТекСтрокаТовары.ЯчейкаКуда Тогда
			
			Сообщить("В строке № " + ТекСтрокаТовары.НомерСтроки + " ячейки ""откуда"" и ""куда"" совпадают", СтатусСообщения.Внимание);
			Отказ = Истина;
			
		КонецЕсли;
		
		// Всё должно быть заполнено
		Если Не ЗначениеЗаполнено(ТекСтрокаТовары.Номенклатура) или Не ЗначениеЗаполнено(ТекСтрокаТовары.Ячейка) или Не ЗначениеЗаполнено(ТекСтрокаТовары.ЯчейкаКуда)  
			или ТекСтрокаТовары.Количество = 0 или ТекСтрокаТовары.КоличествоПереместить = 0 Тогда
			
			Сообщить("В строке № " + ТекСтрокаТовары.НомерСтроки + " не все данные заполнены", СтатусСообщения.Внимание);
			Отказ = Истина;
			
		КонецЕсли;
		
		Если ТекСтрокаТовары.Количество < ТекСтрокаТовары.КоличествоПереместить Тогда
			
			Сообщить("В строке № " + ТекСтрокаТовары.НомерСтроки + " попытка переместить больше, чем есть в ячейке", СтатусСообщения.Внимание);
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		
		// Проверка: Действительно ли в ячейках лежит столько, сколько хотят переместить
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыВЯчейкахОстатки.Номенклатура,
		               |	ТоварыВЯчейкахОстатки.Ячейка,
		               |	ТоварыВЯчейкахОстатки.КоличествоОстаток
		               |ИЗ
		               |	РегистрНакопления.ТоварыВЯчейках.Остатки(
		               |			&Д,
		               |			Склад = &Склад
		               |				И Номенклатура В (&Номенклатура)
		               |				И Ячейка В (&Ячейка)) КАК ТоварыВЯчейкахОстатки
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		               |	РегистрНакопления.ТоварыВЯчейках.Остатки";
		
		Запрос.УстановитьПараметр("Д", МоментВремени());
		
		ФильтрПоНоменклатуре = Товары.ВыгрузитьКолонку("Номенклатура");
		ФильтрПоЯчейкам = Товары.ВыгрузитьКолонку("Ячейка");
		
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Номенклатура", ФильтрПоНоменклатуре);
		Запрос.УстановитьПараметр("Ячейка", ФильтрПоЯчейкам);

		Результат = Запрос.Выполнить();
		НоменклатураВЯчейках = Результат.Выбрать();
		
		Движения.ТоварыВЯчейках.Записывать = Истина;
		Движения.ТоварыВЯчейках.Очистить();
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			СтруктураПоиска = Новый Структура("Номенклатура,Ячейка");
			СтруктураПоиска.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура);
			СтруктураПоиска.Вставить("Ячейка", ТекСтрокаТовары.Ячейка);
			НоменклатураВЯчейках.Сбросить();
			
			Если НоменклатураВЯчейках.НайтиСледующий(СтруктураПоиска) Тогда
				
				Если НоменклатураВЯчейках.КоличествоОстаток < ТекСтрокаТовары.КоличествоПереместить Тогда
					
					Сообщить("Номенклатуры в строке № " + ТекСтрокаТовары.НомерСтроки + " меньше, чем собираетесь переместить ");
					Отказ = Истина;
					Продолжить;
					
				КонецЕсли;
				
			иначе
				
				Сообщить("Номенклатуры в строке № " + ТекСтрокаТовары.НомерСтроки + " нет в ячейке " + ТекСтрокаТовары.Ячейка);
				Отказ = Истина;
				Продолжить;
				
			КонецЕсли;
			
			Движение = Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.Ячейка;
			Движение.Количество = ТекСтрокаТовары.КоличествоПереместить;
			
			Движение = Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.ЯчейкаКуда;
			Движение.Количество = ТекСтрокаТовары.КоличествоПереместить;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Клеверенс И ЗначениеЗаполнено(Ячейка) И ЗначениеЗаполнено(ЯчейкаКуда) Тогда

		Склад = Константы.ОсновнойСклад.Получить();
		
		Для Каждого Стр Из Товары Цикл
			
			Стр.Ячейка = Ячейка;
			Стр.ЯчейкаКуда = ЯчейкаКуда;
			Стр.КоличествоПереместить = Стр.Количество;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
